In [147]:
import numpy as np, pandas as pd

Reading the original dataset
http://archive.ics.uci.edu/ml/datasets/Online+Retail
A transnational data set which contains all the transactions occurring between 01/12/2010 and 09/12/2011 for a UK-based and registered non-store online retail.

In [148]:
retail_dataset = pd.read_csv('data.csv', dtype= {'CustomerID': 'Int64'})
retail_dataset.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/10 8:26,2.55,17850,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/10 8:26,3.39,17850,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/10 8:26,2.75,17850,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/10 8:26,3.39,17850,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/10 8:26,3.39,17850,United Kingdom

In [149]:
retail_dataset.tail()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/11 12:50,0.85,12680,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/11 12:50,2.10,12680,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/11 12:50,4.15,12680,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/11 12:50,4.15,12680,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/11 12:50,4.95,12680,France

In [150]:
retail_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  Int64
 7   Country      541909 non-null  object
dtypes: Int64(1), float64(1), int64(1), object(5)
memory usage: 33.6+ MB

In [151]:
#Formatting Date/Time
#retail_dataset['InvoiceDate'] = pd.to_datetime(retail_dataset['InvoiceDate'], format = '%mm/%dd/%YY %HH:%MM')

#Strings
retail_dataset['Description'] = retail_dataset['Description'].str.replace('.','').str.upper().str.strip()
retail_dataset['Description'] = retail_dataset['Description'].replace('\s+',' ',regex = True)
retail_dataset['InvoiceNo'] = retail_dataset['InvoiceNo'].astype(str).str.upper()
retail_dataset['StockCode'] = retail_dataset['StockCode'].str.upper()
retail_dataset['Country'] = retail_dataset['Country'].str.upper()

C:\Users\Meera Tresa\AppData\Local\Temp\ipykernel_127164\957688194.py:5: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  retail_dataset['Description'] = retail_dataset['Description'].str.replace('.','').str.upper().str.strip()

In [152]:
retail_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  Int64
 7   Country      541909 non-null  object
dtypes: Int64(1), float64(1), int64(1), object(5)
memory usage: 33.6+ MB

In [153]:
Irrelevant = retail_dataset['StockCode'].unique()
Irrelevant.sort()

In [154]:
Irrelevant.shape

(3958,)

In [155]:
type(Irrelevant)

numpy.ndarray

In [156]:
print('Irrelevant Transactions: \n',Irrelevant[::-1][:20])

Irrelevant Transactions:
 ['S' 'POST' 'PADS' 'M' 'GIFT_0001_50' 'GIFT_0001_40' 'GIFT_0001_30'
 'GIFT_0001_20' 'GIFT_0001_10' 'DOT' 'DCGSSGIRL' 'DCGSSBOY' 'DCGS0076'
 'DCGS0074' 'DCGS0073' 'DCGS0072' 'DCGS0071' 'DCGS0070' 'DCGS0069'
 'DCGS0068']

In [157]:
#
retail_dataset.describe().iloc[:,:2]

            Quantity      UnitPrice
count  541909.000000  541909.000000
mean        9.552250       4.611114
std       218.081158      96.759853
min    -80995.000000  -11062.060000
25%         1.000000       1.250000
50%         3.000000       2.080000
75%        10.000000       4.130000
max     80995.000000   38970.000000

Preprocessing based on the above data inspection

In [158]:
#Based on our inspection of data above, we decided to take into consideration only those transactions which had 
#a numeric character in their stock code/product code
validityOfStockCodes = list(map(lambda codes: any(char.isdigit() for char in codes), retail_dataset['StockCode']))
InvalidCodes = [i for i,v in enumerate(validityOfStockCodes) if v == False]
retail_dataset.drop(InvalidCodes , inplace = True)

In [159]:
retail_dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 539113 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    539113 non-null  object
 1   StockCode    539113 non-null  object
 2   Description  537664 non-null  object
 3   Quantity     539113 non-null  int64
 4   InvoiceDate  539113 non-null  object
 5   UnitPrice    539113 non-null  float64
 6   CustomerID   405043 non-null  Int64
 7   Country      539113 non-null  object
dtypes: Int64(1), float64(1), int64(1), object(5)
memory usage: 37.5+ MB

We dropped 2796 rows based on the assumption that transactions with stock codes having no numeric character are not suited for our analysis

Based on zscore, drop rows having irrelevant quantity and price data
scipy.stats.zscore
Z =x-mean/standard deviation

In [160]:
retail_dataset = retail_dataset[(np.abs(sp.stats.zscore(retail_dataset['UnitPrice']))<3) & (np.abs(sp.stats.zscore(retail_dataset['Quantity']))<5)]

In [161]:
retail_dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 535268 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    535268 non-null  object
 1   StockCode    535268 non-null  object
 2   Description  533826 non-null  object
 3   Quantity     535268 non-null  int64
 4   InvoiceDate  535268 non-null  object
 5   UnitPrice    535268 non-null  float64
 6   CustomerID   403922 non-null  Int64
 7   Country      535268 non-null  object
dtypes: Int64(1), float64(1), int64(1), object(5)
memory usage: 37.3+ MB

In [162]:
retail_dataset.describe().iloc[:,:2]

            Quantity      UnitPrice
count  535268.000000  535268.000000
mean        9.515921       3.085990
std        30.254976       2.932413
min     -1060.000000       0.000000
25%         1.000000       1.250000
50%         3.000000       2.080000
75%        10.000000       4.130000
max      1056.000000      16.950000

From our analysis, the quantity is negative for transactions having return items.
The stock codes for such items must start with C
For the transactions with positive quantity, the stock code must not start with C
Cleaning the dataset based on these considerations

In [163]:
retail_dataset.drop(retail_dataset[(retail_dataset.Quantity>0) & (retail_dataset.InvoiceNo.str.contains('C') == True)].index, inplace = True)
retail_dataset.drop(retail_dataset[(retail_dataset.Quantity<0) & (retail_dataset.InvoiceNo.str.contains('C') == False)].index, inplace = True)

In [164]:
retail_dataset[retail_dataset.Description.isna()==True]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
622,536414,22139,NaN,56,12/1/10 11:52,0.0,<NA>,UNITED KINGDOM
1970,536545,21134,NaN,1,12/1/10 14:32,0.0,<NA>,UNITED KINGDOM
1971,536546,22145,NaN,1,12/1/10 14:33,0.0,<NA>,UNITED KINGDOM
1972,536547,37509,NaN,1,12/1/10 14:33,0.0,<NA>,UNITED KINGDOM
1987,536549,85226A,NaN,1,12/1/10 14:34,0.0,<NA>,UNITED KINGDOM
...,...,...,...,...,...,...,...,...
533712,581103,22689,NaN,4,12/7/11 11:58,0.0,<NA>,UNITED KINGDOM
535326,581203,23406,NaN,15,12/7/11 18:31,0.0,<NA>,UNITED KINGDOM
535332,581209,21620,NaN,6,12/7/11 18:35,0.0,<NA>,UNITED KINGDOM
536981,581234,72817,NaN,27,12/8/11 10:33,0.0,<NA>,UNITED KINGDOM
538554,581408,85175,NaN,20,12/8/11 14:06,0.0,<NA>,UNITED KINGDOM

As part of data cleaning we are removing transactions that doesn't have description at all

In [165]:
retail_dataset.drop(retail_dataset[retail_dataset.Description.str.contains('?',regex=False) == True].index, inplace = True)

In [166]:
retail_dataset[retail_dataset.Description.isna()==True]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
622,536414,22139,NaN,56,12/1/10 11:52,0.0,<NA>,UNITED KINGDOM
1970,536545,21134,NaN,1,12/1/10 14:32,0.0,<NA>,UNITED KINGDOM
1971,536546,22145,NaN,1,12/1/10 14:33,0.0,<NA>,UNITED KINGDOM
1972,536547,37509,NaN,1,12/1/10 14:33,0.0,<NA>,UNITED KINGDOM
1987,536549,85226A,NaN,1,12/1/10 14:34,0.0,<NA>,UNITED KINGDOM
...,...,...,...,...,...,...,...,...
533712,581103,22689,NaN,4,12/7/11 11:58,0.0,<NA>,UNITED KINGDOM
535326,581203,23406,NaN,15,12/7/11 18:31,0.0,<NA>,UNITED KINGDOM
535332,581209,21620,NaN,6,12/7/11 18:35,0.0,<NA>,UNITED KINGDOM
536981,581234,72817,NaN,27,12/8/11 10:33,0.0,<NA>,UNITED KINGDOM
538554,581408,85175,NaN,20,12/8/11 14:06,0.0,<NA>,UNITED KINGDOM

We are not interested in transaction where the Unit Price is zero

In [167]:
retail_dataset.drop(retail_dataset[retail_dataset.UnitPrice == 0].index, inplace = True)

In [168]:
retail_dataset.describe().iloc[:,:2]

            Quantity      UnitPrice
count  532820.000000  532820.000000
mean        9.682906       3.100168
std        28.941307       2.931655
min      -960.000000       0.040000
25%         1.000000       1.250000
50%         3.000000       2.080000
75%        10.000000       4.130000
max      1056.000000      16.950000

In [169]:
retail_dataset[retail_dataset.Description.isna()==True]

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country]
Index: []

In the dataset, wherever the Description was NaN only where Unit Price was zero. So those features got cleaned up together

In [170]:
retail_dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 532820 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    532820 non-null  object
 1   StockCode    532820 non-null  object
 2   Description  532820 non-null  object
 3   Quantity     532820 non-null  int64
 4   InvoiceDate  532820 non-null  object
 5   UnitPrice    532820 non-null  float64
 6   CustomerID   403890 non-null  Int64
 7   Country      532820 non-null  object
dtypes: Int64(1), float64(1), int64(1), object(5)
memory usage: 37.1+ MB

In [144]:
retail_dataset[retail_dataset.Description.isna()==True]

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country]
Index: []

we check the 'Description' based on the product 'StockCode' and fill the missing values with the correct 'Description' that is available from the other transactions of the same 'StockCode'.

for index,value in retail_dataset.StockCode[retail_dataset.Description.isna()==True].items():
    if pd.notna(retail_dataset.Description[retail_dataset.StockCode == value]).sum() != 0:
        print("Something")
        retail_dataset.Description[index] = retail_dataset.Description[retail_dataset.StockCode == value].mode()[0]
    else:
        print("Another something")
        retail_dataset.drop(index = index, inplace = True)        
retail_dataset['Description'] = retail_dataset['Description'].astype(str)

In [171]:
retail_dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 532820 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    532820 non-null  object
 1   StockCode    532820 non-null  object
 2   Description  532820 non-null  object
 3   Quantity     532820 non-null  int64
 4   InvoiceDate  532820 non-null  object
 5   UnitPrice    532820 non-null  float64
 6   CustomerID   403890 non-null  Int64
 7   Country      532820 non-null  object
dtypes: Int64(1), float64(1), int64(1), object(5)
memory usage: 37.1+ MB

There are some entries in this dataset where the "UnitPrice" of the same products varies. This may be caused by the possibility of discounts for certain goods or by customized terms for certain clients. Additionally, we can see that various pricing may be offered to the same consumer on two separate days or on the same day to different customers. We therefore use the mode value of each product's 'UnitPrice' for the purposes of this demonstration, assuming that these values are incorrect due to input errors or human errors.

In [172]:
#Cleanup incorrect prices
UniqueStockCodes = retail_dataset.StockCode.unique()
ModePricesForEachStockCode = map(lambda x: retail_dataset.UnitPrice[retail_dataset.StockCode == x].mode()[0],UniqueStockCodes)
ModePricesForEachStockCodeList = list(ModePricesForEachStockCode)
for i,v in enumerate(UniqueStockCodes):
    retail_dataset.loc[retail_dataset['StockCode']== v, 'UnitPrice'] = ModePricesForEachStockCodeList[i]

In [173]:
retail_dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 532820 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    532820 non-null  object
 1   StockCode    532820 non-null  object
 2   Description  532820 non-null  object
 3   Quantity     532820 non-null  int64
 4   InvoiceDate  532820 non-null  object
 5   UnitPrice    532820 non-null  float64
 6   CustomerID   403890 non-null  Int64
 7   Country      532820 non-null  object
dtypes: Int64(1), float64(1), int64(1), object(5)
memory usage: 37.1+ MB

There are several inaccurate customer IDs where we have the same customer ID for two separate countries. If any customer belongs to more than two countries, we replace the wrong value with the mode value of the customer's country in order to eliminate the duplicate entries by grouping the dataframe by "CustomerID."

In [174]:
Customers = retail_dataset.groupby('CustomerID')['Country'].unique()
#Print all customers having entries against more than one country in the dataset
Customers.loc[Customers.apply(lambda x:len(x)>1)]

CustomerID
12370           [CYPRUS, AUSTRIA]
12394          [BELGIUM, DENMARK]
12417            [BELGIUM, SPAIN]
12422    [AUSTRALIA, SWITZERLAND]
12429          [DENMARK, AUSTRIA]
12431        [AUSTRALIA, BELGIUM]
12455             [CYPRUS, SPAIN]
12457       [SWITZERLAND, CYPRUS]
Name: Country, dtype: object

In [175]:
#Replacing country of customers belonging to more than one country as per data entry to one country which has the maximum number of occurences
for i,v in retail_dataset.groupby('CustomerID')['Country'].unique().items():
    if len(v)>1:
        retail_dataset.Country[retail_dataset['CustomerID'] == i] = retail_dataset.Country[retail_dataset['CustomerID'] == i].mode()[0]

In [177]:
Customers = retail_dataset.groupby('CustomerID')['Country'].unique()
Customers.loc[Customers.apply(lambda x:len(x)>1)].count()

0

In [178]:
retail_dataset['FinalPrice'] = retail_dataset['Quantity']*retail_dataset['UnitPrice']

In [179]:
retail_dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 532820 entries, 0 to 541908
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    532820 non-null  object
 1   StockCode    532820 non-null  object
 2   Description  532820 non-null  object
 3   Quantity     532820 non-null  int64
 4   InvoiceDate  532820 non-null  object
 5   UnitPrice    532820 non-null  float64
 6   CustomerID   403890 non-null  Int64
 7   Country      532820 non-null  object
 8   FinalPrice   532820 non-null  float64
dtypes: Int64(1), float64(2), int64(1), object(5)
memory usage: 41.2+ MB

In [191]:
retail_dataset['InvoiceDate'] = pd.to_datetime(retail_dataset['InvoiceDate'], format = '%m/%d/%y %H:%M')

In [192]:

retail_dataset['InvoiceMonth'] = retail_dataset['InvoiceDate'].apply(lambda x: x.strftime('%B'))
retail_dataset['Day of week'] = retail_dataset['InvoiceDate'].dt.day_name()

In [193]:
retail_dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 532820 entries, 0 to 541908
Data columns (total 11 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   InvoiceNo     532820 non-null  object
 1   StockCode     532820 non-null  object
 2   Description   532820 non-null  object
 3   Quantity      532820 non-null  int64
 4   InvoiceDate   532820 non-null  datetime64[ns]
 5   UnitPrice     532820 non-null  float64
 6   CustomerID    403890 non-null  Int64
 7   Country       532820 non-null  object
 8   FinalPrice    532820 non-null  float64
 9   InvoiceMonth  532820 non-null  object
 10  Day of week   532820 non-null  object
dtypes: Int64(1), datetime64[ns](1), float64(2), int64(1), object(6)
memory usage: 49.3+ MB

In [194]:
retail_dataset.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,FinalPrice,InvoiceMonth,Day of week
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.95,17850,UNITED KINGDOM,17.7,December,Wednesday
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.75,17850,UNITED KINGDOM,22.5,December,Wednesday
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,4.15,17850,UNITED KINGDOM,33.2,December,Wednesday
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.75,17850,UNITED KINGDOM,22.5,December,Wednesday
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART,6,2010-12-01 08:26:00,4.25,17850,UNITED KINGDOM,25.5,December,Wednesday

In [195]:
retail_dataset.tail()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,FinalPrice,InvoiceMonth,Day of week
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680,FRANCE,10.20,December,Friday
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680,FRANCE,12.60,December,Friday
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680,FRANCE,16.60,December,Friday
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680,FRANCE,16.60,December,Friday
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680,FRANCE,14.85,December,Friday

In [196]:
#Exporting Processed Data
retail_dataset.to_csv('data_cleaned.csv', date_format = '%Y-%m-%d %H:%M', index = False)

In [197]:
type(data.index)

pandas.core.indexes.range.RangeIndex

In [198]:
type(data.InvoiceDate)

pandas.core.series.Series